INSERT player_position (full_name, short_name) VALUES
  ('левый нападающий', 'ЛН'),
  ('правый нападающий', 'ПрН'),
  ('центральный нападающий', 'ЦН'),
  ('левый защитник', 'ЛЗ'),
  ('правый защитник', 'ПЗ'),
  ('вратарь', 'В');

INSERT city (name) VALUES
  ('Москва'),
  ('Челябинск'),
  ('Нижний Тагил'),
  ('Вашингтон'),
  ('Питсбург'),
  ('Тампа');

INSERT player (first_name, last_name, born_date, birth_place_id, player_position_id, is_right_shoot) VALUES
  ('Александр', 'Овечкин', '1985-09-17', 1, 1, 1),
  ('Илья', 'Ковальчук', '1983-04-15', 1, 1, 1),
  ('Никита', 'Кучеров', '1993-06-17', 1, 2, 0),
  ('Евгений', 'Кузнецов', '1992-05-19', 1, 2, 0),
  ('Евгений', 'Малкин', '1992-05-19', 1, 3, 0),
  ('Сидни', 'Кросби', '1987-08-07', 1, 3, 1),
  ('Коннор', 'Макдэвид', '1997-01-17', 1, 2, 0),
  ('Николас', 'Бэкстрем', '198-11-23', 1, 3, 0),
  ('Ти Джей', 'Оши', '1986-12-23', 1, 2, 1),
  ('Джон', 'Карслон', '1990-01-10', 1, 5, 1),
  ('Мэтт', 'Нисканен', '1986-12-06', 1, 5, 1),
  ('Дмитрий', 'Орлов', '1991-07-21', 1, 4, 0),
  ('Брейден', 'Холтби', '1989-09-12', 1, 6, 0),
  ('Фил', 'Кессел', '1987-10-02', 5, 2, 0),
  ('Крис', 'Летанг', '1987-04-24', 5, 5, 1),
  ('Оли', 'Мяяата', '1994-09-22', 5, 4, 0),
  ('Сергей', 'Бобровский', '1994-05-25', 1, 6, 0);

INSERT team (name, foundation_date) VALUES
  ('Вашингтон Кэпиталз', '1974-01-01'),
  ('Питтсбург Пингвинз', '1967-01-01'),
  ('Тампа-Бэй Лайтнинг', '1992-01-01');

INSERT INTO team_in_city (team_id, city_id) VALUES
  (1, 4),
  (2, 5),
  (3, 6);

INSERT INTO season (start, end) VALUES
  ('2018-10-03', '2019-05-20'),
  ('2017-10-05', '2018-05-24');

INSERT INTO team_roster (season_id, team_id, player_id) VALUES
  (1, 1, 1),
  (1, 1, 4),
  (1, 1, 8),
  (1, 1, 9),
  (1, 1, 10),
  (1, 1, 11),
  (1, 1, 12),
  (1, 1, 13),
  (1, 2, 5),
  (1, 2, 6),
  (1, 2, 7),
  (1, 2, 14),
  (1, 2, 15),
  (1, 2, 16),
  (1, 2, 17);


INSERT INTO team_roster (season_id, team_id, player_id) VALUES
  (2, 1, 1),
  (2, 1, 4),
  (2, 1, 8),
  (2, 1, 9),
  (2, 1, 10),
  (2, 1, 11),
  (2, 1, 12),
  (2, 1, 13),
  (2, 2, 5),
  (2, 2, 6),
  (2, 2, 7),
  (2, 2, 14),
  (2, 2, 15),
  (2, 2, 16),
  (2, 2, 17);

INSERT INTO game (season_id, guest_team_id, home_team_id, time, guest_team_goal_count, home_team_goal_count, start, end) VALUES
  (1, 2, 1, null, 0, 0, '2018-10-09 19:00', null),
  (1, 1, 2, null, 0, 0, '2018-10-04 19:00', null),
  (2, 1, 2, null, 5, 4, '2017-10-04 19:00', '2017-10-04 21:05'),
  (2, 1, 2, null, 7, 1, '2017-10-15 19:00', '2017-10-04 21:05'),
  (2, 2, 1, null, 0, 5, '2017-10-15 19:00', '2017-10-04 21:05'),
  (2, 1, 3, null, 0, 3, '2017-10-15 19:00', '2017-10-04 21:05');

INSERT INTO user (username, email, password, avatar) VALUES
  ('admin', 'admin@gmail.com', 'admin', ''),
  ('user', 'user@gmail.com', 'user', '');

INSERT INTO role (name) VALUES
  ('админ'),
  ('пользователь');

INSERT INTO user_role (user_id, role_id) VALUES
  (1, 1),
  (2, 2);


